// Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

// 2, 3, 7 -> 7
// 44, 5, 78 -> 78
// 22, 3, 9 -> 22

Console.WriteLine("введите перое целое число");
int number1 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("введите второе целое число");
int number2 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("введите третье целое число");
int number3 = Convert.ToInt32(Console.ReadLine());

int max = number1;

number2 > max
max = number2 
number3 > max