// 12. Напишите программу, которая будет принимать на
// вход два числа и выводить, является ли первое число
// кратным второму. Если число 1 не кратно числу 2, то
// программа выводит остаток от деления.
// 34, 5 -> не кратно, остаток 4
// 16, 4 -> кратно


Console.WriteLine("введите первое число");
int numberA = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("введите dnjhjt число");
int numberB = Convert.ToInt32(Console.ReadLine());

int Mult(int num1, int num2)
{

}